"""
定期更新的配置文件
"""

index_name_dict = {
    "000001.SH": "上证指数",
    "399001.SZ": "深证成指",
    "399006.SZ": "创业板指",
    "000688.SH": "科创50",
    "000016.SH": "上证50",
    "000300.SH": "沪深300",
    "000905.SH": "中证500",
    "000852.SH": "中证1000",
    "399303.SZ": "国证2000"
}

industry_name_dict = {
    "801040.SI": "钢铁",
    "801010.SI": "农林牧渔",
    "801050.SI": "有色金属",
    "801080.SI": "电子",
    "801110.SI": "家用电器",
    "801120.SI": "食品饮料",
    "801880.SI": "汽车",
    "801140.SI": "轻工制造",
    "801150.SI": "医药生物",
    "801130.SI": "纺织服饰",
    "801160.SI": "公用事业",
    "801170.SI": "交通运输",
    "801180.SI": "房地产",
    "801210.SI": "社会服务",
    "801780.SI": "银行",
    "801200.SI": "商贸零售",
    "801790.SI": "非银金融",
    "801230.SI": "综合",
    "801030.SI": "基础化工",
    "801710.SI": "建筑材料",
    "801720.SI": "建筑装饰",
    "801730.SI": "电力设备",
    "801740.SI": "国防军工",
    "801750.SI": "计算机",
    "801890.SI": "机械设备",
    "801760.SI": "传媒",
    "801770.SI": "通信",
    "801980.SI": "美容护理",
    "801950.SI": "煤炭",
    "801960.SI": "石油石化",
    "801970.SI": "环保"
}

style_name_dict = {
    "size": "市值",
    "beta": "贝塔",
    "momentum": "动量",
    "earnyield": "盈利",
    "resvol": "波动率",
    "growth": "成长",
    "btop": "估值",
    "leverage": "杠杆",
    "liquidity": "流动性",
    "sizenl": "非线性市值"
}

range_start_dict = {
    "指数成交活跃度": "20201231",
    "估值分位": "20201231",
    "股指基差": "20201231",
    "市场成交额": "20201231",
    "成交集中度": "20201231",
    "截面波动率": "20210104",
    "战胜指数比例": "20201231"
}