"""
alpha config
"""

# 日度净值的list
daily_fund_nav_dict = {
    "300指增": {
        "明汯稳健增长5期": "P48482",
        "幻方300指数增强欣享2号": "SNS958",
        "星阔春山1号沪深300指数增强": "SQF231"
    },
    "500指增": {
        "明汯价值成长1期3号": "SEE194",
        "启林中证500指数增强1号": "SGY379",
        "幻方500指数增强欣享6号": "SNR298",
        "衍复指增三号": "SJH866",
        "诚奇睿盈500指数增强A": "QK761A",
        "诚奇睿盈500指数增强A-former": "P48454",
        "世纪前沿指数增强24号": "STH711",
        "因诺聚配中证500指数增强": "SGX346",
        "赫富500指数增强一号": "SEP463",
        "伯兄熙宁中证500指数增强": "STR792",
        "概率500指增2号": "STJ128",
        "星阔广厦1号中证500指数增强": "SNU706",
        "白鹭精选量化鲲鹏十号": "P48487",
        "黑翼中证500指数增强8号": "T04393",
        "量锐62号": "SGR954",
        "天演中证500指数增强": "P20830",
        "乾象中证500指数增强1号": "P48470"
    },
    "1000指增": {
        "启林玉成一号": "P48474",
        "衍复1000指增一号": "SNP647",
        "明汯量化中小盘增强1号A": "P48700",
        "明汯量化中小盘增强1号": "SGG585",
        "概率1000指增1号": "SQQ803",
        "宽德中证1000指数增强8号": "SXA161",
        "宽德中证1000指数增强8号B": "P50190",
        "九坤日享中证1000指数增强1号": "SCP381"
    },
    "量化多头": {
        "天演赛能": "P22984",
        "星阔山海6号股票优选": "SSE288"
    },
    "其他": {
        "展弘CTA运作1号": "P48471",
        "悬铃C号6期C": "P48469",
        "展弘量化精选1号1期": "SSE967",
        "平行公理同余4号": "STT643",
        "展弘稳进1号1期": "SE8723",
        "百奕传家二号": "SNZ338"
    }
}



